//SDBCHK19 JOB ,CICERO,CLASS=S,MSGCLASS=X,NOTIFY=&SYSUID,REGION=0M
//         JCLLIB ORDER=(DB2P.ISERIES.PROCLIB)
//*
//         EXEC PROC=UNLOAD,TS=CX012T
