 DSN SYSTEM(DB2D)                                                       00150000
 RUN PROGRAM(DSNTEP2) PARMS('/ALIGN(LHS)')                              00160001
 END                                                                    00170000
