 DSN SYSTEM(DB2J)                                                       00150001
 RUN PROGRAM(DSNTEP2) PARMS('/ALIGN(LHS)')                              00160002
 END                                                                    00170000
