--
-- STORCLAS=PRODSTD  -> SALVA NO DISCO NAO WORK
-- STORCLAS=STANDARD -> SALVA NO DISCO WORK
--
//SORTOUT DD   DSN=DBA5.DB2.ALLDB2.ADM.OUTPUT.D130603,
//         DISP=(NEW,CATLG,DELETE),
//         UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),STORCLAS=PRODSTD
