//PRSTEP1      EXEC  PGM=IEBGENER
//SYSPRINT     DD SYSOUT=*
//SYSIN        DD DUMMY
//SYSUT1       DD  DSN=IBM1BEL.RMM.ACTIVE.HOT1.VAULT,DISP=SHR
//SYSUT2   DD  DSN=IBM1BEL.RMM.ACTIVE.HOT1.VAULT.COPY3,
//             DISP=(,CATLG,DELETE),
//             LRECL=131,RECFM=FBA,DSORG=PS,BLKSIZE=0,
//             UNIT=MAGV,VOL=SER=,LABEL=RETPD=010
